{"pages":[],"posts":[{"title":"About me","text":"About meHello everyone, firstly, I’m glad to introduce myself a bit.My name is Son Bui and I have worked as a web application developer for many years, I’m familiar with some languages but the best is Javascript language. I often focus on thinking programming instead of programming languages or frameworks. I love algorithms and resolve challenges.At the moment, I’m studying about the React native so I will have some posts about them after studying by myself and publish them on my blog[my blog - https://kienvietcode.tk]I have been trying to write a blog recently to share what I know and some problems or issues that I faced when coding. I hope they could be useful for someone.Thank you for your reading.","link":"/blog/2021/03/22/about-me/"},{"title":"React native tutorials","text":"React native tutorialsTutorial 1Hello everyone, today I want to share with you about the react native tutorials. Learning by the tutorials is my favorite studying, just with myself.Okay, so it will be the first.In this, I will show you the way to initialize react native project, it’s very easy if you are a software developer but if you are fresher, we will go step by step.I’m using expo to create a new project, if you want to read more, please visit its page.Certainly, because it’s a react native app, so you must install Nodejs and npm.NPM will be installed when you finish installing Nodejs, very convenient here. 1234npm i -g expo-cliexpo --versionexpo init myProjectcd myProject Note:You just type npm i -g expo-cli &amp;&amp; expo --version in the first time if you don’t waste your time :D.If any error through like that: Can't create react native app. Input is required, but expo is in non-interactive mode maybe you are using git bash so you must use normal cmd. Yes, I’m using Window OS, clearly.Okay, that’s it. Thank you for your reading, and hopefully to see you in the next tutorial.","link":"/blog/2021/03/23/reactnative-tutorials-1/"},{"title":"Study English with sport news (translate to Vietnamese)","text":"Lingard: Southgate đã khuyên tôi đến West Ham dưới dạng cho mượn từ Manchester United.Huấn luyện viên đội tuyển Anh đã nói rằng cầu thủ 28 tuổi sẽ tốt hơn khi tiếp tục ở lại Primier League nếu anh rời khỏi Old Trafford. Jesse Lingard đã nói rằng huấn luyện viên đội tuyển Anh đã khuyên anh gia nhập West Ham dưới dạng cho mượn từ Manchester United. Lingard đã không xuất hiện trong các trận đấu của quỷ đỏ trong mùa giải 2020-2021 trước khi anh ký hợp đồng cho mượn tạm thời và chuyển tới West Ham vào tháng một. Cầu thủ 28 tuổi đã có màn trình diễn tuyệt vời với The Hammers, anh ghi được 5 bàn thắng cùng với 2 kiến tạo trong 5 trận đấu đầu tiên ở Premier League và được gọi vào đội tuyển quốc gia Anh. Họ đã nói những gì?“Ông ấy đã hỗ trợ rất nhiều và tin tưởng ở tôi, ông ấy cho tôi cơ hội khoác áo đội tuyển Anh, điều mà tôi tự hào” Lingard đã nói trên talkSPORT về Southgate. “Tôi vẫn giữ liên lạc với ông ấy thậm chí khi tôi không được ra sân, chỉ đề nhận những lời khuyên về những gì tôi nên làm”. “Đó chỉ là sự thay đổi đúng đắn, khi chơi bóng ở châu Âu hay ở lại Premier League”. “Ông ấy đã nói, ‘Nếu tôi là cậu, tôi sẽ ở lại Premier League’. Sau đó, sẽ tìm kiếm một đội bóng ở đây và West Ham là sự lựa chọn hoàn hảo”. Lingard đã có sự trở lại đội tuyển AnhLingard sẽ có cơ hội gia tăng số lần khoác áo đội tuyển quốc gia sau 24 lần ở San Marino, Albania, Ba Lan trong vòng loại World Cup trong tháng này. Cầu thủ tấn công đã trở thành trụ cột của Tam Sư sau khi chứng minh khả năng của mình ở mùa giải 2016, và anh ấy đã bắt đầu nhưng với một trận tứ kết ở World Cup 2018. Phần lớn số lần ra sân của Lingard là vào tháng 6 năm 2019, khi anh ấy bắy đầu tham gia giải UEFA Nations League trận play-off với đội tuyển Thụy Sĩ. Trong lần trờ lại đội tuyển Anh lần này, Lingard cho biết: “tôi đã làm việc chăm chỉ và chuyên nghiệp, và tôi vẫn tin tưởng vào bản thân có thể chơi bóng đỉnh cao. Nếu bạn làm việc chăm chỉ, cuối cùng bạn sẽ nhận được thành quả”. Theo Goal","link":"/blog/2021/03/24/study-english-1/"}],"tags":[{"name":"React native","slug":"React-native","link":"/blog/tags/React-native/"},{"name":"sport news","slug":"sport-news","link":"/blog/tags/sport-news/"}],"categories":[{"name":"React native","slug":"React-native","link":"/blog/categories/React-native/"},{"name":"English","slug":"English","link":"/blog/categories/English/"}]}