{"pages":[],"posts":[{"title":"About me","text":"About meHello everyone, firstly, I’m glad to introduce myself a bit.My name is Son Bui and I have worked as a web application developer for many years, I’m familiar with some languages but the best is Javascript language. I often focus on thinking programming instead of programming languages or frameworks. I love algorithms and resolve challenges.At the moment, I’m studying about the React native so I will have some posts about them after studying by myself and publish them on my blog[my blog - https://kienvietcode.tk]I have been trying to write a blog recently to share what I know and some problems or issues that I faced when coding. I hope they could be useful for someone.Thank you for your reading.","link":"/blog/2021/03/22/about-me/"},{"title":"React native tutorials","text":"React native tutorialsTutorial 1Hello everyone, today I want to share with you about the react native tutorials. Learning by the tutorials is my favorite studying, just with myself.Okay, so it will be the first.In this, I will show you the way to initialize react native project, it’s very easy if you are a software developer but if you are fresher, we will go step by step.I’m using expo to create a new project, if you want to read more, please visit its page.Certainly, because it’s a react native app, so you must install Nodejs and npm.NPM will be installed when you finish installing Nodejs, very convenient here. 1234npm i -g expo-cliexpo --versionexpo init myProjectcd myProject Note:You just type npm i -g expo-cli &amp;&amp; expo --version in the first time if you don’t waste your time :D.If any error through like that: Can't create react native app. Input is required, but expo is in non-interactive mode maybe you are using git bash so you must use normal cmd. Yes, I’m using Window OS, clearly.Okay, that’s it. Thank you for your reading, and hopefully to see you in the next tutorial.","link":"/blog/2021/03/23/reactnative-tutorials-1/"}],"tags":[{"name":"React native","slug":"React-native","link":"/blog/tags/React-native/"}],"categories":[{"name":"React native","slug":"React-native","link":"/blog/categories/React-native/"}]}